[
    {
        "cName":"ARISE ARIEL",
        "cProfession": "Videographer",
        "cMessage":"We’ve worked with Panther Corporation for over a year now, and they’ve become a seamless extension of our team. Their montages and Instagram shorts take our raw footage to the next level – no more spending hours on edits ourselves. The fly-through videos they create for our luxury listings have actually become a selling point our clients ask for by name!"
    },
    {
        "cName":"Caroline",
        "cProfession": "Realtor",
        "cMessage":"I remember sending Panther Corp a messy walkthrough clip, thinking, ‘This might be impossible to salvage.’ What they delivered left me speechless. The final video wasn’t just polished – it told a story about the home. Buyers started saying things like, ‘We could picture our family here,’ which is exactly what I needed. Now I breathe easier knowing they’re handling my edits."
    },
    {
        "cName":"Delta",
        "cProfession": "Realtor",
        "cMessage":"Working with the team on my fly-through video was a delight—their creative touch transformed my footage into an immersive, compelling experience that captures the property perfectly. I'm thrilled with the result."
    },
    {
        "cName":"American Made",
        "cProfession": "Crime Documentary Channel",
        "cMessage":"Working with Panther Pixel was a game-changer. Their custom thumbnails made our videos stand out in a saturated true crime space, and their title optimizations helped us double our average view duration. They 'get' YouTube's algorithm like no one else."
    },
    {
        "cName":"Paul Shin",
        "cProfession": "Automotive Creator",
        "cMessage":"Panther Pixel completely transformed how our audience engages with our content. Their thumbnails increased our CTR by 40% almost overnight, and their SEO tweaks got us ranking for competitive car review terms we'd been chasing for months. This is next-level optimization."
    },
    {
        "cName":"Dave",
        "cProfession": "Out of Spec Style",
        "cMessage":"Panther Pixel’s thumbnails gave my EV reviews a professional edge. The custom designs boosted my CTR by 35%, and I’ve seen more engagement from new viewers. Their work feels premium without losing that authentic YouTube vibe."
    },
    {
        "cName":"Alex",
        "cProfession": "Electric Revolution",
        "cMessage":"As a scooter channel, standing out is tough. Panther Pixel’s thumbnails made my videos pop in search results. My ‘Best Commuter Scooter’ video gained 3x more clicks after their redesign!"
    },
    {
        "cName":"Jake Thompson",
        "cProfession": "Living in Phoenix",
        "cMessage":"I was struggling to get attention for my Phoenix real estate tours. Panther Pixel’s thumbnails made my listings look irresistible—my last video got 2x more leads than usual!"
    },
    {
        "cName":"Sarah K.",
        "cProfession": "First Time Home Buyer Tips",
        "cMessage":"Panther Pixel took my basic real estate thumbnails and turned them into click magnets. My ‘First-Time Buyer Mistakes’ video went from 50 views/day to 300+ after their redesign!"
    },
    {
        "cName":"Mark R.",
        "cProfession": "Luxury Condo Tours",
        "cMessage":"For luxury real estate, presentation is everything. Panther Pixel’s sleek, high-end thumbnails made my condo tours look like premium listings. My engagement skyrocketed!"
    }
]